МедПреды_sql/src/Documents/Визит/Визит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Визит</name>
  <registerRecords>AccumulationRegister.ДанныеВизитовДляОтчета</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ПрофилиМобильногоПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВизита</name>
    <type>
      <types>EnumRef.ВидыВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВизита</name>
    <type>
      <types>EnumRef.СостоянияВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВрача</name>
    <type>
      <types>CatalogRef.КатегорииВрачей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаНачало</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаОкончание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаСупервайзер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаСупервайзер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Препараты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наличие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МедПреды_sql/src/AccumulationRegisters/ДанныеВизитовДляОтчета/ДанныеВизитовДляОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеВизитовДляОтчета</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Исправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Визит</name>
    <type>
      <types>DocumentRef.Визит</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредыдущийВизит</name>
    <type>
      <types>DocumentRef.Визит</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

МедПреды_sql/src/Documents/Визит/ObjectModule.bsl
#Область ОбработчикиСобытий

Функция SSL()
	ssl = Новый ЗащищенноеСоединениеOpenSSL();
	Возврат ssl;
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
			
	//!!
	//Если Отгружен И Оплачен Тогда
	//	СостояниеВизита = Перечисления.СостоянияВизитов.Выполнен;
	//Иначе
	//	СостояниеВизита = Перечисления.СостоянияВизитов.ВРаботе;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	МассивУзловДляРегистрации = Новый Массив;
	
	//Выборка = ПланыОбмена.МобильноеПриложение.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Ссылка <> ПланыОбмена.МобильноеПриложение.ЭтотУзел() Тогда
	//		//Если НЕ ИзЦентральнойБазы Тогда
	//			МассивУзловДляРегистрации.Добавить(Выборка.Ссылка);
	//		//КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если МассивУзловДляРегистрации.Количество() > 0 Тогда
	//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловДляРегистрации, Ссылка);
	//КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДанныеВизитовДляОтчета 
	Движения.ДанныеВизитовДляОтчета.Записывать = Истина;
	Движение = Движения.ДанныеВизитовДляОтчета.Добавить();
	Движение.Период = Дата;
	Движение.Визит = Ссылка;
	Движение.Проект = Проект;
	Движение.Ответственный = Ответственный;
	Движение.Контрагент = Контрагент;
	Движение.КонтактноеЛицо = КонтактноеЛицо;
	Движение.Начало = ДатаНачало;
	Движение.Окончание = ДатаОкончание;

	КоординатыНачало = ГеоМеткаНачало.Получить();
	Если НЕ ЗначениеЗаполнено(КоординатыНачало) Тогда
		КоординатыНачало = Новый ГеографическиеКоординаты(0,0);
	КонецЕсли;
	КоординатыОкончание = ГеоМеткаОкончание.Получить();
	Если НЕ ЗначениеЗаполнено(КоординатыОкончание) Тогда
		КоординатыОкончание = Новый ГеографическиеКоординаты(0,0);
	КонецЕсли;
		
	
	Широта = ?(ЗначениеЗаполнено(ШиротаСупервайзер), ШиротаСупервайзер, МедПредыСервер.Среднее(КоординатыНачало.Широта, КоординатыОкончание.Широта));
	Долгота = ?(ЗначениеЗаполнено(ДолготаСупервайзер), ДолготаСупервайзер, МедПредыСервер.Среднее(КоординатыНачало.Долгота, КоординатыОкончание.Долгота)); 	
	
	Если НЕ (ЗначениеЗаполнено(Широта) Или ЗначениеЗаполнено(Долгота)) Тогда
		Соединение = Новый HTTPСоединение("geocode-maps.yandex.ru", , , , , , SSL());
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type","text/html");
		
		Запрос = Новый HTTPЗапрос(СтрШаблон("1.x/?format=json&geocode=%1", 
		МедПредыСервер.ПолучитьКонтактнуюИнформацию(Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента)),
		Заголовки);
		
		Ответ = Соединение.Получить(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ТекстJSON = Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			СтруктураКоординат = ПрочитатьJSON(ЧтениеJSON);
			Попытка
				Координаты = СтруктураКоординат.response.GeoObjectCollection.featureMember[0].GeoObject.boundedBy.Envelope;
				КоординатыЭталон = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтруктураКоординат.response.GeoObjectCollection.featureMember[0].GeoObject.Point.pos, " ");
				Низ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Координаты.lowerCorner," ");
				Верх = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Координаты.upperCorner," ");
				ГСЧ = Новый ГенераторСлучайныхЧисел;
				Широта  = ГСЧ.СлучайноеЧисло(Число(Низ[1])*1000000, Число(Верх[1])*1000000)/1000000 + (ГСЧ.СлучайноеЧисло(0, 1000)-500)/1000000;
				Долгота = ГСЧ.СлучайноеЧисло(Число(Низ[0])*1000000, Число(Верх[0])*1000000)/1000000 + (ГСЧ.СлучайноеЧисло(0, 1000)-500)/1000000;
			Исключение
				Сообщить("Некорректно заполнен адрес контрагента!!!", СтатусСообщения.Внимание);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	Движение.Широта		= Широта;
	Движение.Долгота	= Долгота;
	
	Движение.Исправлено = ЗначениеЗаполнено(ШиротаСупервайзер) ИЛИ ЗначениеЗаполнено(ДолготаСупервайзер);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Визит.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Визит КАК Визит
	|ГДЕ
	|	Визит.Проведен
	|	И Визит.Контрагент = &Контрагент
	|	И Визит.КонтактноеЛицо = &КонтактноеЛицо
	|	И Визит.Проект = &Проект
	|	И Визит.Дата < &Дата
	|	И Визит.Операция = &Операция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Визит.Дата УБЫВ"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
	Запрос.УстановитьПараметр("КонтактноеЛицо", Ссылка.КонтактноеЛицо);
	Запрос.УстановитьПараметр("Проект", Ссылка.Проект);
	Запрос.УстановитьПараметр("Дата", Ссылка.Дата);
	Запрос.УстановитьПараметр("Операция", Ссылка.Операция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Движение.ПредыдущийВизит = Выборка.Ссылка;
	КонецЕсли;
	
	ДлительностьСекунд = Движение.Окончание-Движение.Начало;
	Часов = Цел(ДлительностьСекунд/3600);
	ДлительностьСекунд = ДлительностьСекунд-Часов*3600;
	Минут = Цел(ДлительностьСекунд/60);
	ДлительностьСекунд = ДлительностьСекунд-Минут*60;
	Секунд = ДлительностьСекунд;
	Движение.Время = Дата(1,1,1,Часов, Минут, Секунд);
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти
